using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleProject__TextRPG_PR2_Park
{
    class RunLeft : BaseScene
    {
        public override void Input()
        {
            
        }

        public override void Render()
        {
            Console.WriteLine("왼쪽방");
            char[,] map = new char[,]
            {
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' },
                {'#','#','#','#','#','#','#','#','#','#','#','#' }
            };
            
        }

        public override void Result()
        {
            
        }

        public override void Update()
        {
            
        }
    }
}
